name: "db5377c3_local_triton_nnop_preprocess"
backend: "python"
max_batch_size: 0

input [
  {
    name: "INPUT0"
    data_type: TYPE_INT8
    dims: [-1, -1, 3]
  }
]

input [
  {
    name: "INPUT1"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [-1, 3, 224, 224]
  }
]

instance_group [
    {
        kind: KIND_GPU
        count: 1
        gpus: [1, 2]
    }
]
