name: "pipeline"
platform: "ensemble"
max_batch_size: 128

input [
  {
    name: "INPUT0"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [512]
  }
]

ensemble_scheduling: {

  step [
    {
      model_name: "cb2876f3_local_triton_py"
      model_version: 1

      input_map {
        key: "INPUT0"
        value: "INPUT0"
      }

      output_map {
        key: "OUTPUT0"
        value: "cb2876f3_OUTPUT0"
      }

      output_map {
        key: "OUTPUT1"
        value: "cb2876f3_OUTPUT1"
      }
    },
    {
      model_name: "fae9ba13_local_triton_nnop_preprocess"
      model_version: 1

      input_map {
        key: "INPUT0"
        value: "cb2876f3_OUTPUT0"
      }

      input_map {
        key: "INPUT1"
        value: "cb2876f3_OUTPUT1"
      }

      output_map {
        key: "OUTPUT0"
        value: "fae9ba13_OUTPUT0"
      }
    },
    {
      model_name: "fae9ba13_local_triton_nnop_model"
      model_version: 1

      input_map {
        key: "INPUT0"
        value: "fae9ba13_OUTPUT0"
      }

      output_map {
        key: "OUTPUT0"
        value: "fae9ba13_local_triton_nnop_model_OUTPUT0"
      }
    },
    {
      model_name: "fae9ba13_local_triton_nnop_postprocess"
      model_version: 1

      input_map {
        key: "INPUT0"
        value: "fae9ba13_local_triton_nnop_model_OUTPUT0"
      }

      output_map {
        key: "OUTPUT0"
        value: "OUTPUT0"
      }
    }
  ]
}