name: "test_model"
backend: "python"
max_batch_size: 128

input [
  {
    name: "INPUT0"
    data_type: TYPE_INT8
    dims: [-1, -1, 3]
  }
]

input [
  {
    name: "INPUT1"
    data_type: TYPE_FP32
    dims: [3, -1, -1]
  }
]

output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [-1, 512]
  }
]
