name: "py_to_triton_test"
backend: "python"
max_batch_size: 0

input [
  {
    name: "INPUT0"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "OUTPUT0"
    data_type: TYPE_INT8
    dims: [-1, -1, 3]
  }
]

output [
  {
    name: "OUTPUT1"
    data_type: TYPE_STRING
    dims: [1]
  }
]
